 

#Область ПрограммныйИнтерфейс

 // М.В. Катеринич, 24.05.2023 20:07:40 { 
 
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы; 
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеПроцентВГруппаШапкаВлево(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	
КонецПроцедуры

// М.В. Катеринич, 24.05.2023 20:07:40  }

#КонецОбласти  

#Область СлужебныйПрограммныйИнтерфейс  

  // М.В. Катеринич, 24.05.2023 20:07:40 { 
  
Процедура   ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.Макс_КонтактноеЛицо"; 
	
КонецПроцедуры

Процедура   ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.Макс_КонтактноеЛицо"; 
	
КонецПроцедуры    

Процедура  ДобавитьПолеПроцентВГруппаШапкаВлево(Форма);
	
	ПолеВвода = Форма.Элементы.Добавить("Макс_ПроцентСкидкиНаценки", Тип("ПолеФормы"),форма.Элементы.ГруппаШапкаЛево); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВвода.ПутьКДанным = "Объект.Макс_ПроцентСкидкиНаценки";  
	Форма.Элементы.Макс_ПроцентСкидкиНаценки.УстановитьДействие("ПриИзменении", "Макс_ПроцентСкидкиНаценкиПриИзменении"); 
	
КонецПроцедуры

// М.В. Катеринич, 24.05.2023 20:07:40  }

#КонецОбласти

  